In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./Data/simple_csv.csv")

Get list of columns, so that you can easily cut/paste/edit available columns...

In [3]:
df.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5', 'col6', 'col7', 'col8', 'col9',
       'col10', 'col11', 'col12', 'col13', 'col14', 'col15'],
      dtype='object')

In [4]:
df2 = df[['col1', 'col2', 'col3', 'col4', 'col5', 'col10']]
df2.head()

               col1 col2  col3     col4   col5     col10
0  20/07/2023 08:29    A     1  123.450  123.5  0.281713
1  21/07/2023 08:29    B     2  123.451  123.5  0.980194
2  21/07/2023 08:29    A     3  123.452  123.5  0.203470
3  21/07/2023 08:29    B     4  123.453  123.5  0.016661
4  21/07/2023 08:29    A     5  123.454  123.5  0.249135

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    25 non-null     object
 1   col2    25 non-null     object
 2   col3    25 non-null     int64
 3   col4    25 non-null     float64
 4   col5    25 non-null     float64
 5   col6    25 non-null     object
 6   col7    25 non-null     object
 7   col8    25 non-null     int64
 8   col9    25 non-null     int64
 9   col10   25 non-null     float64
 10  col11   25 non-null     object
 11  col12   25 non-null     object
 12  col13   25 non-null     int64
 13  col14   25 non-null     int64
 14  col15   25 non-null     int64
dtypes: float64(3), int64(6), object(6)
memory usage: 3.1+ KB

In [6]:
df.describe()

,col3,col4,col5,col8,col9,col10,col13,col14,col15
count,25.000000,25.00000,25.0,25.000000,25.000000,25.000000,25.0,25.0,25.0
mean,13.000000,123.46200,123.5,569478.400000,556.680000,0.474761,8.0,29.0,36.0
std,7.359801,0.00736,0.0,314634.760053,304.660565,0.341960,0.0,0.0,0.0
min,1.000000,123.45000,123.5,10283.000000,18.000000,0.016661,8.0,29.0,36.0
25%,7.000000,123.45600,123.5,418267.000000,290.000000,0.203470,8.0,29.0,36.0
50%,13.000000,123.46200,123.5,622229.000000,588.000000,0.340755,8.0,29.0,36.0
75%,19.000000,123.46800,123.5,823321.000000,808.000000,0.784370,8.0,29.0,36.0
max,25.000000,123.47400,123.5,975661.000000,984.000000,0.980194,8.0,29.0,36.0

Change column type so you can use it e.g. Object --> Datetime

In [7]:
df["datetime"] = pd.to_datetime(df["col1"])
df = df[['datetime', 'col1', 'col2', 'col3', 'col4', 'col5', 'col10']]

df.head()

             datetime              col1 col2  col3     col4   col5     col10
0 2023-07-20 08:29:00  20/07/2023 08:29    A     1  123.450  123.5  0.281713
1 2023-07-21 08:29:00  21/07/2023 08:29    B     2  123.451  123.5  0.980194
2 2023-07-21 08:29:00  21/07/2023 08:29    A     3  123.452  123.5  0.203470
3 2023-07-21 08:29:00  21/07/2023 08:29    B     4  123.453  123.5  0.016661
4 2023-07-21 08:29:00  21/07/2023 08:29    A     5  123.454  123.5  0.249135

Drop (delete) column, and use of 'inplace'.

In [8]:
df.drop("col1", axis=1, inplace=True)
df.head()

             datetime col2  col3     col4   col5     col10
0 2023-07-20 08:29:00    A     1  123.450  123.5  0.281713
1 2023-07-21 08:29:00    B     2  123.451  123.5  0.980194
2 2023-07-21 08:29:00    A     3  123.452  123.5  0.203470
3 2023-07-21 08:29:00    B     4  123.453  123.5  0.016661
4 2023-07-21 08:29:00    A     5  123.454  123.5  0.249135

Sort, check unique and group by...

In [9]:
df.sort_values(by="col4", ascending=False, inplace=True)
df.head()

              datetime col2  col3     col4   col5     col10
24 2023-07-21 08:29:00    A    25  123.474  123.5  0.340755
23 2023-07-21 08:29:00    B    24  123.473  123.5  0.969033
22 2023-07-21 08:29:00    A    23  123.472  123.5  0.020075
21 2023-07-21 08:29:00    B    22  123.471  123.5  0.144076
20 2023-07-21 08:29:00    A    21  123.470  123.5  0.253127

In [10]:
df.col2.unique()

array(['A', 'B'], dtype=object)

In [11]:
df = df.groupby(by=["col2"], as_index=False).sum()
df

  col2  col3      col4    col5     col10
0    A   169  1605.006  1605.5  5.465350
1    B   156  1481.544  1482.0  6.403669

Filter by column value

In [12]:
df=df[df.col2=="A"]
df.head()

  col2  col3      col4    col5    col10
0    A   169  1605.006  1605.5  5.46535

In [13]:
df.to_csv("./Data/Dumb DF Output.csv")

In [15]:
df2dict = df.to_dict('dict')
for k, v in df2dict.items():
    print(f"For {k} value(s) = {v}")

For col2 value(s) = {0: 'A'}
For col3 value(s) = {0: 169}
For col4 value(s) = {0: 1605.006}
For col5 value(s) = {0: 1605.5}
For col10 value(s) = {0: 5.465350108}

In [24]:
for keys, values in df.iterrows():
    print(df["col2"], df["col3"])

0    A
Name: col2, dtype: object 0    169
Name: col3, dtype: int64